import React, { useState } from 'react';
import { useForm } from 'react-hook-form';
import { MdDone } from 'react-icons/md';
import { toast } from 'react-toastify';

import { useCreateFundRequestMutation } from '@/redux/auth/authApi';
import { selectUser } from '@/redux/auth/selectors';
import { useAppSelector } from '@/redux/hooks';

import { ProfileInput } from '@/components/profile/ProfileInput';
import { Modal, SharedBtn } from '@/components/ui';
import Spinner from '../ui/Spinner';

interface IProps {
  closePage: () => void;
  balance?: number;
}

interface IForm {
  sum?: number;
  card?: string;
  agreement: boolean;
}

const WithdrawingMoneyModal: React.FC<IProps> = ({
  closePage,
  balance = 0,
}) => {
  const [agreement, setAgreement] = useState(false);
  const [createFundRequest, { isLoading }] = useCreateFundRequestMutation();
  const { id } = useAppSelector(selectUser);

  const {
    register,
    handleSubmit,
    formState: { errors, isValid },
  } = useForm<IForm>({
    mode: 'onChange',
    defaultValues: { sum: undefined, card: undefined },
  });

  const onSubmit = async (data: IForm) => {
    if (isValid) {
      const response = await createFundRequest({
        body: { cartNumber: data.card!, amount: data.sum! },
        id,
      });
      if (response.data?.status !== 200) {
        toast.error('Щось пішло не так, спробуйте ще раз');
      } else {
        closePage();
        toast.success('Запит на виведення коштів відправлено');
      }
    }
  };

  const checkAgreement = () => {
    setAgreement(!agreement);
  };

  if (isLoading) {
    return <Spinner />;
  }

  return (
    <Modal isOpen onClose={closePage} hiddenCross>
      <div
        className="w-[600px] bg-background py-6 rounded-[20px] border-2 border-buttonPurple 
      flex flex-col items-center"
      >
        <h1 className="w-full text-center text-[32px] font-normal leading-none border-b-2 border-buttonPurple pb-4">
          Вивести кошти
        </h1>
        <form
          onSubmit={handleSubmit(onSubmit)}
          className="mt-6 mb-8 max-w-[312px]"
        >
          <div className="flex flex-col gap-0 lg:mb-[8px] mb-0 font-lato">
            <div>
              <p className="mb-3 text-base font-bold">Сума</p>
              <ProfileInput
                {...register('sum', {
                  validate: {
                    required: value => true,
                    max: value =>
                      (value && value <= balance) || 'Недостатньо коштів',
                    min: value =>
                      (value && value >= 100) || 'Мінімальна сума 100₴',
                  },
                })}
                placeholder="7000₴"
                id="sum"
                htmlFor="sum"
                autoComplete="sum"
                label=""
                error={errors?.sum?.message}
              />
            </div>

            <div className="relative">
              <p className="mb-3 text-base font-bold">Змінити пароль</p>
              <ProfileInput
                {...register('card', {
                  required: 'Номер картки обовʼязковий',
                  pattern: {
                    value: /^[0-9]{16}$/,
                    message: 'Номер картки має складатися з 16 цифр',
                  },
                })}
                placeholder="**** **** **** **** "
                id="card"
                htmlFor="card"
                label=""
                error={errors?.card?.message}
              />
              <div className="absolute right-3 bottom-10 flex pointer-events-none">
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="32"
                  height="32"
                  viewBox="0 0 32 32"
                  fill="none"
                >
                  <path
                    d="M29.259 5.25732H2.74475C1.35615 5.25732 0.230469 6.38301 0.230469 7.77161V24.2288C0.230469 25.6174 1.35615 26.743 2.74475 26.743H29.259C30.6476 26.743 31.7733 25.6174 31.7733 24.2288V7.77161C31.7733 6.38301 30.6476 5.25732 29.259 5.25732Z"
                    fill="#F8FBFF"
                  />
                  <path
                    fillRule="evenodd"
                    clipRule="evenodd"
                    d="M9.71351 19.8931H7.77495L6.32124 14.3471C6.25225 14.092 6.10574 13.8665 5.89024 13.7602C5.35241 13.4931 4.75977 13.2804 4.11328 13.1732V12.9597H7.23616C7.6672 12.9597 7.99045 13.2804 8.0443 13.653L8.79858 17.6534L10.7362 12.9597H12.6209L9.71351 19.8931ZM13.6984 19.8931H11.8676L13.3752 12.9597H15.206L13.6984 19.8931ZM17.5746 14.8804C17.6285 14.5071 17.9518 14.2935 18.3289 14.2935C18.9216 14.2399 19.5671 14.3471 20.1059 14.6133L20.4291 13.1205C19.8903 12.907 19.2977 12.7998 18.7599 12.7998C16.983 12.7998 15.6899 13.7602 15.6899 15.0931C15.6899 16.1071 16.6058 16.6394 17.2523 16.9602C17.9518 17.28 18.2212 17.4935 18.1673 17.8133C18.1673 18.2931 17.6285 18.5066 17.0907 18.5066C16.4442 18.5066 15.7977 18.3467 15.206 18.0795L14.8827 19.5732C15.5292 19.8394 16.2287 19.9467 16.8752 19.9467C18.8677 19.9993 20.1059 19.0399 20.1059 17.5998C20.1059 15.7863 17.5746 15.68 17.5746 14.8804ZM26.5133 19.8931L25.0596 12.9597H23.4981C23.1749 12.9597 22.8516 13.1732 22.7439 13.4931L20.052 19.8931H21.9367L22.3129 18.88H24.6286L24.8441 19.8931H26.5133ZM23.7675 14.8269L24.3053 17.4399H22.7978L23.7675 14.8269Z"
                    fill="#172B85"
                  />
                </svg>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="32"
                  height="32"
                  viewBox="0 0 32 32"
                  fill="none"
                >
                  <path
                    d="M29.7946 5.24121H2.20838C1.1419 5.24121 0.277344 6.10576 0.277344 7.17225V24.8274C0.277344 25.8939 1.1419 26.7585 2.20838 26.7585H29.7946C30.8611 26.7585 31.7256 25.8939 31.7256 24.8274V7.17225C31.7256 6.10576 30.8611 5.24121 29.7946 5.24121Z"
                    fill="#F8FBFF"
                  />
                  <path
                    fillRule="evenodd"
                    clipRule="evenodd"
                    d="M11.7237 22.0085V22.8232V23.6381H11.3665V23.4402C11.2533 23.587 11.0814 23.6791 10.8478 23.6791C10.3872 23.6791 10.0262 23.3212 10.0262 22.8232C10.0262 22.3257 10.3872 21.9675 10.8478 21.9675C11.0814 21.9675 11.2533 22.0595 11.3665 22.2063V22.0085H11.7237ZM10.8922 22.3015C10.5831 22.3015 10.3939 22.5368 10.3939 22.8232C10.3939 23.1097 10.5831 23.345 10.8922 23.345C11.1876 23.345 11.387 23.1199 11.387 22.8232C11.387 22.5267 11.1876 22.3015 10.8922 22.3015ZM23.792 22.8232C23.792 22.5368 23.9812 22.3015 24.2904 22.3015C24.5861 22.3015 24.7851 22.5267 24.7851 22.8232C24.7851 23.1199 24.5861 23.345 24.2904 23.345C23.9812 23.345 23.792 23.1097 23.792 22.8232ZM25.1222 21.354V22.8232V23.6381H24.7647V23.4402C24.6514 23.587 24.4795 23.6791 24.2459 23.6791C23.7854 23.6791 23.4243 23.3212 23.4243 22.8232C23.4243 22.3257 23.7854 21.9675 24.2459 21.9675C24.4795 21.9675 24.6514 22.0595 24.7647 22.2063V21.354H25.1222ZM16.1567 22.2848C16.3868 22.2848 16.5347 22.4279 16.5724 22.6801H15.7201C15.7583 22.4448 15.9022 22.2848 16.1567 22.2848ZM15.3457 22.8232C15.3457 22.3152 15.6824 21.9675 16.1638 21.9675C16.624 21.9675 16.9402 22.3152 16.9437 22.8232C16.9437 22.8709 16.9402 22.9154 16.9366 22.9595H15.717C15.7685 23.2529 15.9781 23.3587 16.2082 23.3587C16.373 23.3587 16.5484 23.297 16.6861 23.1882L16.8611 23.4508C16.6617 23.6178 16.4352 23.6791 16.1878 23.6791C15.6961 23.6791 15.3457 23.3415 15.3457 22.8232ZM20.4761 22.8232C20.4761 22.5368 20.6652 22.3015 20.9744 22.3015C21.2697 22.3015 21.4692 22.5267 21.4692 22.8232C21.4692 23.1199 21.2697 23.345 20.9744 23.345C20.6652 23.345 20.4761 23.1097 20.4761 22.8232ZM21.8058 22.0085V22.8232V23.6381H21.4487V23.4402C21.335 23.587 21.1636 23.6791 20.9299 23.6791C20.4693 23.6791 20.1083 23.3212 20.1083 22.8232C20.1083 22.3257 20.4693 21.9675 20.9299 21.9675C21.1636 21.9675 21.335 22.0595 21.4487 22.2063V22.0085H21.8058ZM18.4591 22.8232C18.4591 23.3177 18.806 23.6791 19.3354 23.6791C19.5828 23.6791 19.7476 23.6245 19.9262 23.4847L19.7547 23.1983C19.6206 23.2939 19.4798 23.345 19.3248 23.345C19.0396 23.3415 18.83 23.137 18.83 22.8232C18.83 22.5095 19.0396 22.305 19.3248 22.3015C19.4798 22.3015 19.6206 22.3526 19.7547 22.4482L19.9262 22.1618C19.7476 22.0221 19.5828 21.9675 19.3354 21.9675C18.806 21.9675 18.4591 22.3288 18.4591 22.8232ZM22.6306 22.2063C22.7234 22.0631 22.8575 21.9675 23.0636 21.9675C23.136 21.9675 23.239 21.9811 23.3181 22.0119L23.208 22.346C23.1325 22.3152 23.0569 22.305 22.9846 22.305C22.7509 22.305 22.6341 22.4549 22.6341 22.7245V23.6381H22.2766V22.0085H22.6306V22.2063ZM13.4901 22.138C13.3182 22.0256 13.0814 21.9675 12.8202 21.9675C12.4041 21.9675 12.1363 22.1653 12.1363 22.4892C12.1363 22.755 12.3357 22.9189 12.703 22.97L12.8718 22.9938C13.0676 23.0211 13.1601 23.0722 13.1601 23.1643C13.1601 23.2904 13.0295 23.3622 12.7856 23.3622C12.5382 23.3622 12.3597 23.2838 12.2393 23.1916L12.071 23.4675C12.2668 23.6108 12.5142 23.6791 12.7821 23.6791C13.2564 23.6791 13.5313 23.4574 13.5313 23.1472C13.5313 22.8607 13.315 22.7109 12.9575 22.6598L12.7892 22.6355C12.6346 22.6152 12.5107 22.5848 12.5107 22.4755C12.5107 22.3562 12.6275 22.2848 12.8234 22.2848C13.033 22.2848 13.236 22.3632 13.3355 22.4245L13.4901 22.138ZM17.6655 22.2063C17.7579 22.0631 17.892 21.9675 18.0981 21.9675C18.1705 21.9675 18.2735 21.9811 18.3525 22.0119L18.2424 22.346C18.1669 22.3152 18.0914 22.305 18.019 22.305C17.7854 22.305 17.6686 22.4549 17.6686 22.7245V23.6381H17.3115V22.0085H17.6655V22.2063ZM15.0503 22.0085H14.4662V21.514H14.1052V22.0085H13.7721V22.3323H14.1052V23.0758C14.1052 23.4539 14.2531 23.6791 14.6755 23.6791C14.8304 23.6791 15.009 23.6315 15.1223 23.553L15.0192 23.2494C14.9126 23.3107 14.7958 23.3415 14.703 23.3415C14.5244 23.3415 14.4662 23.2322 14.4662 23.0687V22.3323H15.0503V22.0085ZM9.71032 22.6152V23.6381H9.34928V22.7312C9.34928 22.4549 9.23248 22.3015 8.98861 22.3015C8.75143 22.3015 8.58663 22.4518 8.58663 22.7347V23.6381H8.22558V22.7312C8.22558 22.4549 8.10563 22.3015 7.86845 22.3015C7.6242 22.3015 7.46613 22.4518 7.46613 22.7347V23.6381H7.10547V22.0085H7.46299V22.2094C7.59711 22.0186 7.76859 21.9675 7.94398 21.9675C8.1949 21.9675 8.3735 22.0768 8.48677 22.2574C8.63816 22.0288 8.85449 21.9639 9.06414 21.9675C9.46293 21.971 9.71032 22.2301 9.71032 22.6152Z"
                    fill="#231F20"
                  />
                  <path
                    d="M18.7838 19.2393H13.3711V9.58789H18.7838V19.2393Z"
                    fill="#FF5F00"
                  />
                  <path
                    d="M13.7163 14.414C13.7163 12.4561 14.6401 10.7121 16.0789 9.58826C15.0268 8.76641 13.6989 8.27588 12.2559 8.27588C8.83964 8.27588 6.07031 11.024 6.07031 14.414C6.07031 17.804 8.83964 20.5521 12.2559 20.5521C13.6989 20.5521 15.0268 20.0615 16.0789 19.2397C14.6401 18.1158 13.7163 16.3718 13.7163 14.414Z"
                    fill="#EB001B"
                  />
                  <path
                    d="M26.0871 14.414C26.0871 17.804 23.3178 20.5521 19.9015 20.5521C18.4584 20.5521 17.1306 20.0615 16.0781 19.2397C17.5172 18.1158 18.4412 16.3718 18.4412 14.414C18.4412 12.4561 17.5172 10.7121 16.0781 9.58826C17.1306 8.76641 18.4584 8.27588 19.9015 8.27588C23.3178 8.27588 26.0871 11.024 26.0871 14.414Z"
                    fill="#F79E1B"
                  />
                </svg>
              </div>
            </div>
          </div>
          <label className="flex items-center gap-3 cursor-pointer">
            <input
              id="unlimitedTickets"
              type="checkbox"
              className="appearance-none absolute opacity-0 pointer-events-none"
              checked={agreement}
              onChange={checkAgreement}
            />
            <div className="min-h-6 min-w-6 h-6 w-6 flex items-center justify-center bg-lightPink rounded-[5px]">
              {agreement && <MdDone className="text-black w-6 h-6" />}
            </div>
            <span className="text-xs">
              Я підтверджую, що вказані банківські реквізити належать мені
              особисто та згоден/-на з їх використанням для отримання виплат.
            </span>
          </label>
        </form>
        <div className="flex flex-row items-center gap-[32px]">
          <SharedBtn
            onClick={handleSubmit(onSubmit)}
            type="button"
            primary
            className="w-[230px] h-12"
          >
            Підтвердити
          </SharedBtn>
          <SharedBtn
            type="button"
            secondary
            className="w-[230px] h-12"
            onClick={closePage}
          >
            Скасувати
          </SharedBtn>
        </div>
      </div>
    </Modal>
  );
};

export default WithdrawingMoneyModal;
