import delete_insteadOfPhotoFromZoom from '../../../public/images/delete_insteadOfPhotoFromZoom.png'


const WhoWeAre = () => {
    return (
        <div className='mb-16'>
            <h1 className='pb-8'>Хто ми?</h1>
            <div className="flex gap-20">
                <img src={delete_insteadOfPhotoFromZoom} alt="" />
                <div>
                    <h4 className="pb-6 text-4xl">Ось більше про нас (чи якось так)</h4>
                    <p className='w-[520px] h-[300px] leading-[25px] font-normal'>Ми – команда ентузіастів, які об’єдналися заради спільної ідеї. Усі ми – джуни: тестери, розробники, дизайнери та наш проджект-менеджер, який і зібрав нас разом. Йому прийшла ідея створити щось справді корисне для молоді, і ми всі підхопили цю ідею. Ми помітили, що існує безліч платформ для купівлі квитків на масштабні події, але немає місця, де будь-хто міг би легко організувати свою подію – майстер-клас, стендап чи вебінар. Так народився BookMyEvent – платформа, де кожен може не лише знайти цікаві події, а й створити власну та почати заробляти. Нам важливо зробити цей процес простим, зручним і доступним. Ми віримо, що великі ідеї починаються з малого, і, можливо, саме твоя подія стане наступним хітом!</p>
                </div>
            </div>
        </div>
    )
}

export default WhoWeAre